[
  {
    "Id": 0,
    "Name": "DarkSouls III",
    "Description": "Dark Souls III is a 2016 action role-playing game developed by FromSoftware and published by Bandai Namco Entertainment. Released for PlayStation 4, Xbox One, and Windows, the game is the third and final entry in the Dark Souls series and follows an unkindled warrior on a quest to prevent the end of the world.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/Dark_souls_3_cover_art.jpg",
    "Categories": [
      {
        "Id": 0,
        "Name": "Action"
      },
      {
        "Id": 2,
        "Name": "RPG"
      }
    ]
  },
  {
    "Id": 1,
    "Name": "Super Mario Bros.",
    "Description": "Super Mario Bros. is a 1985 platform game developed and published by Nintendo for the Nintendo Entertainment System (NES). It is the successor to the 1983 arcade game Mario Bros. and the first game in the Super Mario series. It was originally released in September 1985 in Japan for the Family Computer; following a US test market release for the NES, it was converted to international arcades on the Nintendo VS. System in early 1986. The NES version received a wide release in North America that year and in PAL regions in 1987.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/super-mario-bros-cover.jpg",
    "Categories": [
      {
        "Id": 1,
        "Name": "Platformer"
      }
    ]
  },
  {
    "Id": 2,
    "Name": "Minecraft",
    "Description": "Minecraft is a 2011 sandbox game developed and published by Swedish video game developer Mojang Studios. Originally created by Markus \u0027Notch\u0027 Persson using the Java programming language, the first public alpha build was released on 17 May 2009.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/minecraft-cover.jpeg",
    "Categories": [
      {
        "Id": 3,
        "Name": "Sandbox"
      }
    ]
  },
  {
    "Id": 3,
    "Name": "Red Dead Redemption 2",
    "Description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/red_dead_redemption_2_cover.jpg",
    "Categories": [
      {
        "Id": 0,
        "Name": "Action"
      }
    ]
  },
  {
    "Id": 4,
    "Name": "Terraria",
    "Description": "Terraria is a 2011 action-adventure sandbox game developed by Re-Logic and published by 505 Games. The game features exploration, combat, crafting, building, and mining inside a procedurally generated 2D world. It has several world difficulties, as well as a character class system.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/terraria-cover.jpg",
    "Categories": [
      {
        "Id": 0,
        "Name": "Action"
      },
      {
        "Id": 3,
        "Name": "Sandbox"
      }
    ]
  },
    {
    "Id": 5,
    "Name": "Grand Theft Auto V",
    "Description": "Grand Theft Auto V is a 2013 action-adventure game developed by Rockstar North and published by Rockstar Games. It is the seventh main entry in the Grand Theft Auto series, following 2008's Grand Theft Auto IV, and the fifteenth instalment overall.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/grand-theft-auto-v-cover.jpg",
    "Categories": [
      {
        "Id": 4,
        "Name": "Open world" 
      },
      {
        "Id": 0,
        "Name": "Action"
      }
    ]
  },
  {
    "Id": 6,
    "Name": "Muck",
    "Description": "Trapped in the muck on an island, alone or with your friends, try to survive as long as possible by using the resources you find around the island. Collect resources, craft tools, weapons, & armor, find items & build your base during day. But once night falls, mysterious enemies appear from the shadows. Using the resources and items you've crafted during the day, you must try and make it through the night.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/muck-cover.jpg",
    "Categories": [
      {
        "Id": 5,
        "Name": "Survival" 
      },
      {
        "Id": 6,
        "Name": "RogueLike" 
      }
    ]
  },
  {
    "Id": 7,
    "Name": "Mirror's Edge Catalyst",
    "Description": "Follow Faith, a daring free runner, as she fights for freedom in the city of Glass. What appears to be an elegant, high-tech city on the outside, has a terrible secret hidden within. Explore every corner from the highest beautifully lit rooftops to the dark and gritty tunnels below. The city is huge, free to roam and Faith is at the center of it all. Through the first-person perspective, combine her fluid movement and advanced combat with the city's surroundings to master the environment and uncover the conspiracy.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/mirrors-edge-catalyst-cover.jpg",
    "Categories": [
      { 
        "Id": 0,
        "Name": "Action" 
      },
      { 
        "Id": 4,
        "Name": "Open world" 
      }
    ]
  },
  {
    "Id": 8,
    "Name": "God of War",
    "Description": "Enter the Norse realm - His vengeance against the Gods of Olympus years behind him, Kratos now lives as a man in the realm of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same.",
    "Image": "https://raw.githubusercontent.com/LukaLominadze/GameDrive/refs/heads/resources/god-of-war-cover.jpg",
    "Categories": [
      {
        "Id": 0,
        "Name": "Action"
      },
      { 
        "Id": 7,
        "Name": "Adventure"
      }
    ]
  }
]
